Repository: kingrpaul/eo-glossary
Catalog: tm/the-hanging-stranger_en_eo.tmx
Source language: en
Languages: eo

source: en-US
eo: eo

source: The Hanging Stranger
eo: La Pendanta Fremdulo

source: Ed had always been a practical man, when he saw something was wrong he tried to correct it.
eo: Edo ĉiam estis praktika viro, kiam li vidis ke io estas malĝusta li provis korekti ĝin.

source: Then one day he saw it hanging in the town square.
eo: Iun tagon li vidis ĝin pendantan en la urba placo.

source: Five o’clock Ed Loyce washed up, tossed on his hat and coat, got his car out and headed across town toward his TV sales store.
eo: Je la kvina horo Edo Lojso lavis sin, surĵetis sian ĉapelon kaj mantelon, prenis sian aŭton kaj iris trans la urbo al sian butikon de televidiloj.

source: He was tired.
eo: Li estis laca.

source: His back and shoulders ached from digging dirt out of the basement and wheeling it into the back yard.
eo: Lia dorso kaj ŝultroj doloris sin ĉar li fosis grundon el la kelo kaj ruli ĝin en la malantaŭan korton.

source: But for a forty-year-old man he had done okay.
eo: Sed por kvardek jara viro, li faris sufiĉe bone.

source: Janet could get a new vase with the money he had saved; and he liked the idea of repairing the foundations himself!
eo: Janeto povus akiri novan vazon per la mono, kiun li ŝparis; kaj li ŝatis la ideon ripari la fundamentojn sin mem!

source: It was getting dark.
eo: Iĝadis malhele.

source: The setting sun cast long rays over the scurrying commuters, tired and grim-faced, women loaded down with bundles and packages, students swarming home from the university, mixing with clerks and businessmen and drab secretaries.
eo: La subiranta suno ĵetis longajn radiojn super la homoj rapidantaj al siajn laborejojn, lacaj kaj malgajaj-vizaĝaj, virinoj ŝarĝitaj per faskoj kaj pakaĵoj, studentoj svarmantaj hejmen de la universitato, miksante kun oficistoj kaj komercistoj kaj malspritaj sekretarioj.

source: He stopped his Packard for a red light and then started it up again.
eo: Li malŝaltis sian Pakard-aŭton pro ruĝa semaforo kaj sekve ŝaltis ĝin denove.

source: The store had been open without him; he’d arrive just in time to spell the help for dinner, go over the records of the day, maybe even close a couple of sales himself.
eo: La butiko estis malferma sen li; li alvenus apenaŭ sufiĉe frue por anstataŭi la helpanton dum vespermango, kontroli la kvitancojn de la tago, eble eĉ mem vendi iom.

source: He drove slowly past the small square of green in the center of the street, the town park.
eo: Li stiris la aŭton malrapide preter la malgranda kvadrato de verdo en la centro de la strato, la urbeta parko.

source: There were no parking places in front of Loyce TV Sales and Service.
eo: Estis neniom neokupitaj lokoj por parki antaŭ Lojso TV Vendo kaj Riparo.

source: He cursed under his breath and swung the car in a U-turn.
eo: Li sakris subspire kaj svingis la aŭton en duoncirklo.

source: Again he passed the little square of green with its lonely drinking fountain and bench and single lamppost.
eo: Denove li preterpasis la malgrandan kvadraton de verdo kun ĝia soleca trinkfonto kaj benko kaj unuopa lanterna stango.

source: From the lamppost something was hanging.
eo: De la lanterna stango, io estis pendanta.

source: A shapeless dark bundle, swinging a little with the wind.
eo: Senforma malhela fasko, svinganta iomete per la vento.

source: Like a dummy of some sort.
eo: Kiel ia manekeno.

source: Loyce rolled down his window and peered out.
eo: Lojso rulis malalten sian fenestron kaj intense vidis eksteren.

source: What the hell was it?
eo: Kio diable ĝi estis?

source: A display of some kind?
eo: Elmontraĵo ia?

source: Sometimes the Chamber of Commerce put up displays in the square.
eo: Foje la Ĉambro de Komerco starigis elmontraĵojn en la placo.

source: Again he made a U-turn and brought his car around.
eo: Denove li faris duoncirklon kaj kondukis sian aŭton ĉirkaŭe.

source: He passed the park and concentrated on the dark bundle.
eo: Li preterpasis la parkon kaj pripensis la malhelan faskon.

source: It wasn’t a dummy.
eo: Ĝi ne estis manekeno.

source: And if it was a display it was a strange kind.
eo: Kaj se ĝi estis elmontraĵo ĝi estas stranga speco.

source: The hackles on his neck rose and he swallowed uneasily.
eo: La haroj sur lia kolo leviĝis kaj li ekglutis maltrankvile.

source: Sweat slid out on his face and hands.
eo: Svito glitis sur lia vizaĝo kaj manoj.

source: It was a body.
eo: Estis korpo.

source: A human body.
eo: Homa korpo.

source: “Look at it!” Loyce snapped.
eo: “Rigardu ĝin!” Lojso klakis.

source: “Come on out here!”
eo: “Venu nun ekstere ĉi tien!”

source: Don Fergusson came slowly out of the store, buttoning his pin-stripe coat with dignity.
eo: Dono Fergusono eliris malrapide el la vendejo, butonanta digne lian pinglan strian mantelon.

source: “This is a big deal, Ed.
eo: “Ĉi tiu estas granda vendo, Edo.

source: I can’t just leave the guy standing there.”
eo: Mi ne povas nur lasi la ulon starante tie.”

source: “See it?” Ed pointed into the gathering gloom.
eo: “Ĉu vi vidas ĝin?” Edo indikis per la fingro en la amasiĝantan mornon.

source: The lamppost jutted up against the sky⁠—the post and the bundle swinging from it.
eo: La lanterna stango elstaris kontraŭ la ĉielo⁠—la stango kaj la fasko svinganta de ĝi.

source: “There it is.
eo: “Tie estas.

source: How the hell long has it been there?” His voice rose excitedly.
eo: Kiom diable longe ĝi estantas tie?” Lia voĉo leviĝis ekscitite.

source: “What’s wrong with everybody?
eo: “Kio malĝustas ĉe ĉiuj?

source: They just walk on past!”
eo: Ili nur promenas plu!”

source: Don Fergusson lit a cigarette slowly.
eo: Dono Fergusono ekbruligis cigaredon malrapide.

source: “Take it easy, old man.
eo: “Trankviliĝu, ulo.

source: There must be a good reason, or it wouldn’t be there.”
eo: Devas esti bona kialo, alie ĝi ne estus tie.”

source: “A reason!
eo: “Kialo!

source: What kind of a reason?”
eo: Kia kialo?”

source: Fergusson shrugged.
eo: Fergusono ŝultrolevis.

source: “Like the time the Traffic Safety Council put that wrecked Buick there.
eo: “Kiel la fojo, kiam la Konsilio de Trafika Sakureco metis tiun vrakan Buik-aŭton tie.

source: Some sort of civic thing.
eo: Ia da civita afero.

source: How would I know?”
eo: Kiel mi scius?”

source: Jack Potter from the shoe shop joined them.
eo: Ĵako Potero de la ŝua butiko aliĝis al ili.

source: “What’s up, boys?”
eo: “Kio okazas, uloj?”

source: “There’s a body hanging from the lamppost,” Loyce said.
eo: “Estas korpo pendanta de la lanterna stango,” Lojso diris.

source: “I’m going to call the cops.”
eo: “Mi intencas voki la policanojn.”

source: “They must know about it,” Potter said.
eo: “Ili certe scias pri ĝi” Potero diris.

source: “Or otherwise it wouldn’t be there.”
eo: “Aŭ alie ĝi ne estus tie.”

source: “I got to get back in.” Fergusson headed back into the store.
eo: “Mi devus reeniri.” Fergusono ekreeniris la butikon.

source: “Business before pleasure.”
eo: “Komerco antaŭ plezuro.”

source: Loyce began to get hysterical.
eo: Lojso komencis iĝi histeria.

source: “You see it?
eo: “Ĉu vi vidis ĝin?

source: You see it hanging there?
eo: Ĉu vi vidis ĝin pendanta tie?

source: A man’s body!
eo: Korpo de viro!

source: A dead man!”
eo: Mortinta viro!”

source: “Sure, Ed.
eo: “Certe, Edo.

source: I saw it this afternoon when I went out for coffee.”
eo: Mi vidis ĝin ĉi posttagmeze, kiam mi eliris por kafo.”

source: “You mean it’s been there all afternoon?”
eo: Vi intencas diri, ke ĝi estis tie la tutan posttagmezon.

source: “Sure.
eo: “Certe.

source: What’s the matter?” Potter glanced at his watch.
eo: Kio misas?” Potero rigardetis lian brakhorlogon.

source: “Have to run.
eo: “Devas kuri.

source: See you later, Ed.”
eo: Ĝis la revido, Edo.”

source: Potter hurried off, joining the flow of people moving along the sidewalk.
eo: Potero elrapidis, aliĝinte al la fluo de homoj kiuj moviĝis laŭ la trotuaro.

source: Men and women, passing by the park.
eo: Viroj kaj virinoj, preterpasanta la parko.

source: A few glanced up curiously at the dark bundle⁠—and then went on.
eo: Kelkaj rigardis supren scivole al la malhela fasko⁠—kaj tiam iris daŭre.

source: Nobody stopped.
eo: Neniu haltis.

source: Nobody paid any attention.
eo: Neniu atentis iom.

source: “I’m going nuts,” Loyce whispered.
eo: “Mi iĝas freneza,” Lojso flustris.

source: He made his way to the curb and crossed out into traffic, among the cars.
eo: Li faris sian vojon al la trotuarrando kaj eltransiris en la trafiko, inter la aŭtoj.

source: Horns honked angrily at him.
eo: Aŭtoj hupis kolere al li.

source: He gained the curb and stepped up onto the little square of green.
eo: Li gajnis la trotuarrando kaj paŝis supre sur la malgrandan kvadraton de verdo.

source: The man had been middle-aged.
eo: La viro estis mezaĝa.

source: His clothing was ripped and torn, a gray suit, splashed and caked with dried mud.
eo: Lia vestaĝoj estis disŝirita kaj distirita, griza kompleto, surŝprucigita kaj kukita per sekita koto.

source: A stranger.
eo: Fremdulo.

source: Loyce had never seen him before.
eo: Lojso neniam vidis lin antaŭe.

source: Not a local man.
eo: Ne loka viro.

source: His face was partly turned, away, and in the evening wind he spun a little, turning gently, silently.
eo: Lia vizaĝo estis parte turniĝita, for, kaj en la vespera vento li turnis iomete, turnanta milde, silente.

source: His skin was gouged and cut.
eo: Lia haŭto estis guĝita kaj tranĉita.

source: Red gashes, deep scratches of congealed blood.
eo: Ruĝaj fendoj, profundaj gratoj da koaguliĝinta sango.

source: A pair of steel-rimmed glasses hung from one ear, dangling foolishly.
eo: Paro da ŝtala kadrita okulovitroj pendis de unu orelo, pendanta malsaĝule.

source: His eyes bulged.
eo: Lia okuloj ŝvelis.

source: His mouth was open, tongue thick and ugly blue.
eo: Lia buŝo estis malferma, lingo dika kaj malbela blua.

source: “For Heaven’s sake,” Loyce muttered, sickened.
eo: “Por la Ĉielo,” Lojso murmuretis, ekmalsaniĝe.

source: He pushed down his nausea and made his way back to the sidewalk.
eo: Li subpremis sian naŭzon kaj trovis lian vojon ree al la trotuaron.

source: He was shaking all over, with revulsion⁠—and fear.
eo: Li tremis tute, pro abomeno⁠—kaj timo.

source: Why? Who was the man?
eo: Kial? Kiu estis la viro?

source: Why was he hanging there?
eo: Kial li pendadis tie?

source: What did it mean?
eo: Kion ĝi signifis?

source: And⁠—why didn’t anybody notice?
eo: Kaj⁠—kial neniu rimarkis?

source: He bumped into a small man hurrying along the sidewalk.
eo: Li enfrapis malgrandan viron rapidantan laŭ la trotuaro.

source: “Watch it!” the man grated, “Oh, it’s you, Ed.”
eo: “Atentu!” la viro diris knarante, “Ho, estas vi, Edo.”

source: Ed nodded dazedly.
eo: Edo kapsignis stuporite.

source: “Hello, Jenkins.”
eo: “Saluton, Jenkinso.”

source: “What’s the matter?” The stationery clerk caught Ed’s arm.
eo: “Kio misas?” La paperisto kaptis la brakon de Edo.

source: “You look sick.”
eo: “Vi ŝajnas malsana.”

source: “The body.
eo: “La korpo.

source: There in the park.”
eo: Tie en la parko.”

source: “Sure, Ed.” Jenkins led him into the alcove of Loyce TV Sales and Service.
eo: “Certe, Edo.” Jenkinso kondukis lin en la alkovo de Lojso TV Vendo kaj Riparo.

source: “Take it easy.”
eo: “Trankviliĝu.”

source: Margaret Henderson from the jewelry store joined them.
eo: Margareto Hendersono de la juvelejo aliĝis al ilin.

source: “Something wrong?”
eo: “Io misas?”

source: “Ed’s not feeling well.”
eo: Edo ne sentas sana.

source: Loyce yanked himself free.
eo: Lojso ektiregis sin mem libera.

source: “How can you stand here?
eo: “Kiel vi povas stari tie?

source: Don’t you see it?
eo: Ĉu vi ne vidas ĝin?

source: For God’s sake⁠—”
eo: Pro Dio⁠—”

source: “What’s he talking about?” Margaret asked nervously.
eo: “Pri kio li parolas?” Margareto dimandis nervoze.

source: “The body!” Ed shouted.
eo: “La korpo!” Edo kriis.

source: “The body hanging there!”
eo: “La korpo pendanta tie!”

source: More people collected.
eo: Pli da homoj kolektiĝis.

source: “Is he sick?
eo: “Ĉu li malsanas?

source: It’s Ed Loyce.
eo: Estas Edo Lojso.

source: You okay, Ed?”
eo: Ĉu vi fartas bone, Edo?”

source: “The body!” Loyce screamed, struggling to get past them.
eo: “La korpo!” Lojso kriegis, luktanta por preterpasi ilin.

source: Hands caught at him.
eo: Manoj ekkaptis lin.

source: He tore loose.
eo: Li malfiksiĝis.

source: “Let me go!
eo: “Delasu min!

source: The police!
eo: La policanoj!

source: Get the police!”
eo: Akiru la policanoj!”

source: “Ed⁠—”
eo: “Edo⁠—”

source: “Better get a doctor!”
eo: “Devus akiri kuraciston!”

source: “He must be sick.”
eo: Li devus esti malsani.

source: “Or drunk.”
eo: “Aŭ ebria.”

source: Loyce fought his way through the people.
eo: Lojso batalis lian vojon tra la homoj.

source: He stumbled and half fell.
eo: Li stumblis kaj duona falis.

source: Through a blur he saw rows of faces, curious, concerned, anxious.
eo: Trans malklaraĵo li vidis vicojn da vizaĝoj, scivola, zorga, maltrankvila.

source: Men and women halting to see what the disturbance was.
eo: Viroj kaj virinoj haltanta por vidi kio la perturbo estis.

source: He fought past them toward his store.
eo: Li batalis preter ilin al sia butiko.

source: He could see Fergusson inside talking to a man, showing him an Emerson TV set.
eo: Li povis vidi Fergusono interne parolanta al viro, montrantas al li Emersona televidilo.

source: Pete Foley in the back at the service counter, setting up a new Philco.
eo: Peto Foleo en la malantaŭo ĉe la serva tablo, priparanta nova Philco.

source: Loyce shouted at them frantically.
eo: Lojso kriis al ili freneze.

source: His voice was lost in the roar of traffic and the murmur around him.
eo: Lia voĉo estis perdanta en la muĝo de trafiko kaj la murmuro cirkaŭ li.

source: “Do something!” he screamed.
eo: “Agu io!” li kriegis.

source: “Don’t stand there!
eo: “Ne staru tie!

source: Do something!
eo: Agu io!

source: Something’s wrong!
eo: Io misas!

source: Something’s happened!
eo: Io okazis!

source: Things are going on!”
eo: Aferoj okazas!”

source: The crowd melted respectfully for the two heavy-set cops moving efficiently toward Loyce.
eo: La homamaso fandiĝis respekte por la du diketaj policanoj moviĝantaj efike al Lojso.

source: “Name?” the cop with the notebook murmured.
eo: “Nomo?” murmuris la policano kiu havis la kajeron.

source: “Loyce.” He mopped his forehead wearily.
eo: “Lojso.” Li ŝvabris sian frunton lace.

source: “Edward C. Loyce.
eo: “Edvardo C. Lojso.

source: Listen to me.
eo: Aŭskultu min.

source: Back there⁠—”
eo: Reen tie⁠—”

source: “Address?” the cop demanded.
eo: “Adreso?” la policano postule demandis.

source: The police car moved swiftly through traffic, shooting among the cars and buses.
eo: La polica aŭto moviĝis rapide en la trafiko, navedanta inter la aŭtoj kaj busoj.

source: Loyce sagged against the seat, exhausted and confused.
eo: Lojso malvigliĝis kontraŭ la sidejo, lacega kaj konfuzita.

source: He took a deep shuddering breath.
eo: Li prenis profundan tremantan spiron.

source: “1368 Hurst Road.”
eo: “1368 Vojo de Hursto.”

source: “That’s here in Pikeville?”
eo: “Tio estas en Pikurbeto?”

source: “That’s right.” Loyce pulled himself up with a violent effort.
eo: “Prave.” Lojso tiris sin mem supre per violenta penado.

source: “Listen to me.
eo: “Aŭskultu min.

source: Back there.
eo: Reen tie.

source: In the square.
eo: En la placo.

source: Hanging from the lamppost⁠—”
eo: Pendanta de la lanterna stango⁠—”

source: “Where were you today?” the cop behind the wheel demanded.
eo: “Kie vi estis hodiaŭ?” la policano malantaŭ la stirrado postule demandis.

source: “Where?” Loyce echoed.
eo: “Kie?” Lojso eĥis.

source: “You weren’t in your shop, were you?”
eo: “Vi ne estis en via laborejo, ĉu ne?”

source: “No.” He shook his head.
eo: “Ne.” Li kapneis.

source: “No, I was home.
eo: “Ne, mi estis hejme.

source: Down in the basement.”
eo: Malsupre en la kelo.”

source: “In the basement?”
eo: “En la kelo?”

source: “Digging.
eo: “Fosinta.

source: A new foundation.
eo: Nova fundamento.

source: Getting out the dirt to pour a cement frame.
eo: Eliriganta la grundon por verŝi cementa kadro.

source: Why?
eo: Kial?

source: What has that to do with⁠—”
eo: Kiel tiu rilatas pri⁠—”

source: “Was anybody else down there with you?”
eo: “Ĉu iu alia estis malsupre tie kun vi?”

source: “No.
eo: “Ne.

source: My wife was downtown.
eo: Mia edzino estis urbocentre.

source: My kids were at school.” Loyce looked from one heavy-set cop to the other.
eo: Mia infanoj estis lerneje.” Lojso rigardis el unu diketaj policano al la alian.

source: Hope flicked across his face, wild hope.
eo: Esperon flagris tra lia vizaĝo, savaĝa espero.

source: “You mean because I was down there I missed⁠—the explanation?
eo: “Ĉu vi signifas ke ĉar mi estis malsupre tie mi maltrafis⁠—la eksplikon?

source: I didn’t get in on it?
eo: Mi ne partoprenis ĝin?

source: Like everybody else?”
eo: Kiel ĉiuj alia?”

source: After a pause the cop with the notebook said: “That’s right.
eo: Post paŭzo la policano kun la kajero diris: “Prave.

source: You missed the explanation.”
eo: Vi maltrafis la eksplikon.”

source: “Then it’s official?
eo: “Do ĝi estas oficiala?

source: The body⁠—it’s supposed to be hanging there?”
eo: La korpo⁠—ĝi intence pendas tie?”

source: “It’s supposed to be hanging there.
eo: “Ĝi intence pendas tie.

source: For everybody to see.”
eo: Por ke ĉiuj vidi.”

source: Ed Loyce grinned weakly.
eo: Edo Lojso ridetis malforte.

source: “Good Lord.
eo: “Bona Dio.

source: I guess I sort of went off the deep end.
eo: Mi supozas, ke mi kvazaŭ eliris la profundan finon.

source: I thought maybe something had happened.
eo: Mi pensis ke eble io okazis.

source: You know, something like the Ku Klux Klan.
eo: Vi scias, io kiel la Ku Kluks Klan.

source: Some kind of violence.
eo: Ia violento.

source: Communists or Fascists taking over.” He wiped his face with his breast-pocket handkerchief, his hands shaking.
eo: Komunistoj aŭ faŝistoj povprenanta.” Li viŝis lian vizaĝon per sia brusta poŝo naztuko, sia manoj tremante.

source: “I’m glad to know it’s on the level.”
eo: “Mi ĝojas scii, ke ĝi estas sur la nivelo.”

source: “It’s on the level.” The police car was getting near the Hall of Justice.
eo: “Ĝi estas sur la nivelo.” La polica aŭto proksimiĝis al la Halo de Justeco.

source: The sun had set.
eo: La suno estis subirinta.

source: The streets were gloomy and dark.
eo: La stratoj estis mornaj kaj mallumaj.

source: The lights had not yet come on.
eo: La lumoj ankoraŭ ne estis ŝaltintaj.

source: “I feel better,” Loyce said.
eo: “Mi fartas pli bone,” Lojso diris.

source: “I was pretty excited there, for a minute.
eo: “Mi estis sufiĉe ekscitita tie, dum minuto.

source: I guess I got all stirred up.
eo: Mi ŝajnas ke mi iĝis ĉio miksanta.

source: Now that I understand, there’s no need to take me in, is there?”
eo: Do nun ke mi komprenas, ne estas bezono pro enpreni min, ĉu ne?”

source: The two cops said nothing.
eo: La du policanoj diris nenion.

source: “I should be back at my store.
eo: “Mi devas reveni ĉe mia butiko.

source: The boys haven’t had dinner.
eo: La knaboj ne vespermanĝis.

source: I’m all right, now.
eo: Mi fartas bone, nun.

source: No more trouble.
eo: Ne plu embarason.

source: Is there any need of⁠—”
eo: Ĉu ial necesas por⁠—”

source: “This won’t take long,” the cop behind the wheel interrupted.
eo: “Ĉi tio ne daŭros longe,” la policano malantaŭ la stirrado interrompis.

source: “A short process.
eo: “Mallonga procezo.

source: Only a few minutes.”
eo: Nur kelkaj minutoj.”

source: “I hope it’s short,” Loyce muttered.
eo: “Mi esperas ke ĝi daŭros mallonge,” Lojso murmuretis.

source: The car slowed down for a stoplight.
eo: La aŭto malrapidis por semaforo.

source: “I guess I sort of disturbed the peace.
eo: “Mi supozas, ke mi iom ĝenis la pacon.

source: Funny, getting excited like that and⁠—”
eo: Stranga, iĝi ekscita en tiel maniero kaj⁠—”

source: Loyce yanked the door open.
eo: Lojso ekpuŝis la pordon malfermite.

source: He sprawled out into the street and rolled to his feet.
eo: Li elfalis mallerte sur la straton kaj rulĝis al sian piedon.

source: Cars were moving all around him, gaining speed as the light changed.
eo: Aŭtoj moviĝis ĉirkaŭ li, akceliĝi dum la ŝanĝo de la semafora.

source: Loyce leaped onto the curb and raced among the people, burrowing into the swarming crowds.
eo: Lojso saltis sur la trotuarrando kaj kuregis inter la homoj, truanta en la svarmantajn homamasojn.

source: Behind him he heard sounds, shouts, people running.
eo: Malantaŭ li, li aŭdis sonojn, kriojn, homojn kurantajn.

source: They weren’t cops.
eo: Ili ne estis policanoj.

source: He had realized that right away.
eo: Li konas ĉiu policano en Pikurbeto.

source: He knew every cop in Pikeville. A man couldn’t own a store, operate a business in a small town for twenty-five years without getting to know all the cops.
eo: Viro ne povus posedi butikon, prizorgi entreprenon en malgranda urbeto dum dudek jaroj sen konatiĝi ĉiujn policanojn.

source: They weren’t cops⁠—and there hadn’t been any explanation.
eo: Ili ne estis policanoj⁠—kaj estis neniu ekspliko.

source: Potter, Fergusson, Jenkins, none of them knew why it was there.
eo: Potero, Fergusono, Jenkinso, neniu sciis kial li estis tie.

source: They didn’t know⁠—and they didn’t care.
eo: Ili ne sciis⁠—kaj ili ne zorgis.

source: That was the strange part.
eo: Tiu estis la stranga parto.

source: Loyce ducked into a hardware store.
eo: Lojso ekkaŭris en hardvaran vendejon.

source: He raced toward the back, past the startled clerks and customers, into the shipping room and through the back door.
eo: Li kuregis al la malantaŭo, preter la konsterniĝantaj komizoj kaj klientoj, en la ekspedan ĉambron kaj trans la malantaŭan pordon.

source: He tripped over a garbage can and ran up a flight of concrete steps.
eo: Li stumblis de rubujo kaj kuris supre betona ŝtuparo.

source: He climbed over a fence and jumped down on the other side, gasping and panting.
eo: Li grimpis super barilo kaj malsupre sur la alia flanko, anhelanta kaj elblovanta.

source: There was no sound behind him.
eo: Estis neniom da aŭdo malantaŭ lin.

source: He had got away.
eo: Li estis eskapinta.

source: He was at the entrance of an alley, dark and strewn with boards and ruined boxes and tires.
eo: Li estis ĉe la enirejo de strateto, malhela kaj sterninta per tabuloj kaj ruinaj skatoloj kaj pneŭoj.

source: He could see the street at the far end.
eo: Li povis vidi la straton ĉe la fora fino.

source: A street light wavered and came on.
eo: Strata lumo ŝanceliĝis kaj ŝaltiĝis.

source: Men and women.
eo: Viroj kaj virinoj.

source: Stores.
eo: Butikoj.

source: Neon signs.
eo: Neonaj signoj.

source: Cars.
eo: Aŭtoj.

source: And to his right⁠—the police station.
eo: Kaj dekstre⁠—la policejo.

source: He was close, terribly close.
eo: Li estis proksima, terure proksima.

source: Past the loading platform of a grocery store rose the white concrete side of the Hall of Justice.
eo: Preter la ŝargplatformo de nutraĵa vendejo supreniris la blanka betona flanko de la Halo de Justeco.

source: Barred windows.
eo: Baritaj fenestroj.

source: The police antenna.
eo: La polica anteno.

source: A great concrete wall rising up in the darkness.
eo: Granda betona muro supreniĝanta en la mallumeco.

source: A bad place for him to be near.
eo: Malbona loko por li esti proksime.

source: He was too close.
eo: Li estis tro proksima.

source: He had to keep moving, get farther away from them.
eo: Li bezonis moviĝi daŭre, iri pli for de ili.

source: Them?
eo: Ilin?

source: Loyce moved cautiously down the alley.
eo: Lojso moviĝis zorge laŭ la strateto.
